/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */

"btn_pay" = "Payer";
"btn_submit" = "Soumettre";
"btn_next" = "Prochaine";
"btn_skip" = "Passer";

"btn_send_sms" = "envoyer SMS";
"btn_resend_sms" = "renvoyer après \n%d sec";

/* 界面 - JP 收银台 */
"navbar_checkout_title" = "Paiement";
"btn_checkout_agreement" = "J'ai accepté le accord JollyPay et sauvegardé cette carte pour une utilisation ultérieure";
"btn_checkout_agreement_highlight" = "accord JollyPay";

"label_checkout_completion_time" = "Complétez le paiement en";

"cell_label_checkout_default_tips" = "Payer avec une carte de débit/crédit";
"cell_label_checkout_default_change" = "changement";
"cell_label_checkout_discount" = "Réduction";

"cell_label_paymethod_balance" = "Solde";
"cell_label_paymethod_balance_left" = "Restant";
"cell_label_paymethod_balance_invalid" = "Le montant de la commande dépasse le solde disponible";

/* 界面 - 收银台加载异常 */
"label_loadingerror_inited_title" = "Reinitialisation échouée";
"label_loadingerror_inited_detail" = "Veuillez revenir et réessayer.";
"btn_loadingerror_inited_operation" = "Réessayer";

"label_loadingerror_network_title" = "OUPS";
"label_loadingerror_network_detail" = "Veuillez vérifier votre connexion réseau";
"btn_loadingerror_network_operation" = "Réessayer";

"label_loadingerror_unusual_detail" = "Désolé, votre compte a été bloqué en raison d'activités anormales. Veuillez essayer une autre méthode de paiement.";
"btn_loadingerror_unusual_operation" = "Retour";

/* 界面 - 银行卡组件 */
"placeholder_bankpayment_card_number" = "Numéro de carte";
"placeholder_bankpayment_mmyy" = "MM/AA";
"placeholder_bankpayment_cvvcode" = "Code CVV";
"placeholder_bankpayment_card_holder_name" = "Nom sur la carte (facultatif)";

/* 界面 - 银行卡支付 */
"label_bankpayment_mada" = "Cette carte est une carte Mada.";

/* 界面 - 银行卡验证 */
"label_validcard_header_title" = "Mettez à jour vos informations de carte";
"label_validcard_header_description" = "L'option de paiement de votre compte utilisant la carte %@ se terminant par %@ doit être mise à jour pour compléter cette transaction";
"btn_validcard_delete" = "Oublié ou perdu? Supprimer cette carte";
"btn_validcard_delete_highlight" = "Supprimer cette carte";
"tips_validcard_delete" = "Cliquez sur Confirmer pour supprimer la carte %@ %@";

/* 界面 - SADAD 支付 */
"placeholder_sadad_account" = "Entrez l'identifiant de paiement en ligne";
"btn_sadad_change" = "Modifier?";
"label_sadad_description" = "À votre attention s'il vous plaît:\n1. Vous pouvez utiliser SADAD avec presque toutes les banques saoudiennes.\n2.  Le paiement en ligne SADAD est différent du SADAD normal. Avec cette méthode, vous n'avez pas besoin d'un 'Code de Facturation'.\n\nVous n'avez pas de compte SADAD?\n Pas de problème, veuillez suivre ces étapes et compléter votre paiement.\n\n1.  Connectez-vous à votre compte bancaire et abonnez-vous au service SADAD.\n2. Entrez votre nom d'utilisateur SADAD qui a été créé précédemment avec votre compte bancaire.\n3. Entrez votre mot de passe enregistré.\n4. Entrez le mot de passe à usage unique envoyé sur votre mobile.\n5. Confirmez et complétez le paiement.";
"lable_sadad_title" = "Montant du paiement";

/* 界面 - 绑定手机 */
"label_bindphone_title" = "Liez votre numéro de portable";
"label_bindphone_description" = "Pour la sécurité de votre compte, veuillez d'abord lier votre numéro de portable.";
"label_bindphone_region_title" = "Région";
"label_bindphone_region_value" = "Saudi Arabia";
"label_bindphone_note" = "Remarque: le code de vérification sera envoyé au téléphone mobile lorsque vous effectuez un paiement avec des cartes bancaires dans votre compte. Aassurez-vous que le numéro de téléphone portable est le vôtre.";

/* 界面 - 选择手机国家码 */
"label_selectcountry_title" = "veuillez sélectionner";

/* 界面 - 验证手机号 */
"label_validphone_title" = "Vérification par SMS";
"label_validphone_description" = "Le code de vérification a été envoyé à : ";
"placeholder_validphone_smscode" = "Code de vérification";
"placeHolder_validphone_number" = "Numéro de portable";

/* 界面 - 支付密码设置 */
"label_setpassword_title" = "Définir le mot de passe";
"label_setpassword_description" = "Le mot de passe de paiement sera nécessaire chaque fois que vous effectuez un paiement avec des cartes bancaires dans votre compte. Veuillez le définir et le mémoriser.";
"label_resetpassword_title" = "Réinitialiser le mot de passe de paiement";
"label_comfirmpassword_title" = "confirmer le mot de passe";
"label_setpassword_payment_title" = "Réglage du mot de passe";
"label_couponinfo_description" = "%@ de réduction sera utilisé.";

/* 界面 - 快捷支付 */
"label_quickpayment_inputpwd_title" = "Entrer le mot de passe de paiement";
"btn_quickpayment_inputpwd_forgot" = "Mot de passe oublié ?";
"label_quickpayment_inputsms_title" = "Vérification par SMS";
"label_quickpayment_inputsms_description" = "La transaction nécessite une confirmation par SMS. Le code de vérification a été envoyé au: ";

/* 界面 - 支付结果 */
"label_result_success_title" = "Terminé";
"label_result_success_detail" = "Paiement réussi";

"label_result_pending_title" = "En attente/En cours de traitement";
"label_result_pending_detail" = "Le paiement est en attente de traitement. Paiement en cours.";

"label_result_error_title" = "ERREUR";
"label_result_error_detail" = "cette transaction ne peut être complétée en raison d'un solde insuffisant.";

"label_result_oops_title" = "OUPS";
"label_result_oops_detail" = "the operation was declined  because the transaction had been completed";

/* 界面 - 用户协议 */
"navbar_agreement_title" = "Accord";

/* 界面 - 3DS 支付 */
"navbar_3ds_title" = "Vérification 3D Secure";

/* 界面 - 银行卡支付中绑卡 */
"label_payment_bindcard_note" = "Pour enregistrer cette carte, vous devez vérifier votre numéro de téléphone pour définir le mot de passe de paiement";

/* 提示信息 */
"tips_action_ok" = "OK";
"tips_action_cancel" = "Annuler";
"tips_action_goto_setup" = "Configurer";
"tips_action_verify_sms" = "vérifier par code SMS";
"tips_action_retry" = "Réessayer";
"tips_action_confirm" = "Confirmer";
"tips_action_enable" = "Activer";
"tips_action_enter_pwd" = "Entrer le mot de passe";

"tips_operation_success" = "réussi";
"tips_operation_processing" = "En cours de traitement";

"tips_network_timeout" = "Expiré en raison d'une erreur système";
"tips_response_order_expired" = "Désolé, la commande a expiré.";
"tips_response_error" = "Erreur inconnue. Il est impossible d'évaluer clairement la cause du problème. Veuillez réessayer";

"tips_checkout_setpwd" = "Veuillez configurer votre mot de passe de paiement avant d'effectuer le paiement";

"tips_title_invalid_pwd" = "Mot de passe incorrect";
"tips_quickpaymentcode_invalid_twice" = "Mot de passe incorrect. Essayez encore deux fois ou utilisez le code de vérification";
"tips_quickpaymentcode_invalid_once" = "Mot de passe incorrect. Vous avez encore un essai.";

"tips_sadad_invalid_account" = "L'identifiant de compte SADAD ​​doit comporter des caractères alphanumériques et des caractères spéciaux";
"tips_sadad_length_account" = "L'identifiant de compte SADAD ​​doit comporter entre 6 et 12 caractères";

/* 手机号校验 */
"tips_phone_invalid_length" = "Votre numéro de téléphone doit être composé de %@ chiffres";
"tips_phone_invalid_prefix" = "Votre numéro de téléphone doit commencer par %@";
"tips_phone_invalid" = "Veuillez entrer un numéro de téléphone valide";

"tips_verification_sended" = "Le code de vérification a été envoyé sur votre téléphone.";
"tips_verification_invalid" = "veuillez entrer un code de vérification valide";

"tips_password_warning_weak" = "le mot de passe est trop faible, veuillez le saisir à nouveau.";
"tips_password_error_match" = "Les deux mots de passe que vous avez entrés ne correspondent pas. Veuillez les saisir à nouveau.";

"tips_payment_bankcard_notsupported" = "désolé, cette carte n'est pas acceptée";
"tips_currency_charged_description" = "Vous serez facturé %@";

"tips_payment_timeout" = "La transaction a expiré";

/* 生物验证 */
"tips_authid_enable_title" = "Activer le paiement par Visage/Toucher pour JollyPay";
"tips_authid_allow_description" = "Veuillez vérifier votre %@";
"tips_authid_face" = "Face ID";
"tips_authid_touch" = "Touch ID";
"tips_authid_locked" = "Dévérouillez votre téléphone";

/* 退出收银台 */
"tips_checkout_exit" = "Le paiement n'a pas été complété, voulez-vous quitter?";

/* Session 失效 */
"response_msg_session_expired" = "Désolé, la session a expiré.";
/* 营销系统 - 红包无效 */
"response_msg_coupon_invalid" = "Désolé, le coupon ne peut pas être utilisé, veuillez réessayer.";
/* 手机号 - 已被使用 */
"response_msg_phone_bind_used" = "Le numéro de téléphone a déjà été utilisé, veuillez utiliser un autre.";
/* 验证码 - 发送失败 */
"response_msg_phone_sms_send_failure" = "Envoi de la vérification échoué. Veuillez réessayer.";
/* 验证码 - 手机号被锁 */
"response_msg_phone_sms_locked" = "Désolé, vous avez échoué à %@ reprises. La fonction sera verrouillée pendant %@ minutes.";
/* 支付 - 转汇查询超时 */
"response_msg_currency_timeout" = "Impossible d'accéder au taux de change. Veuillez réessayer.";
/* 支付 - 币种不支持 */
"response_msg_currency_not_supported" = "Désolé, cette devise n'est pas supportée";
/* 支付 - 预路由失败 */
"response_msg_payment_preouting_error" = "Impossible d'effectuer la transaction. Veuillez réessayer.";
/* 支付 - 风控拦截 */
"response_msg_payment_intercepted" = "La transaction n’a pas eu lieu car la commande est à haut risque.";
/* 支付 - 支付账号被锁 */
"response_msg_payment_account_locked" = "Désolé, vous avez échoué à plusieurs reprises. Votre compte sera verrouillé pendant %@ minutes.";
/* 银行卡 - 绑卡超出范围 */
"response_msg_bankcard_bind_outrnage" = "Désolé, vous ne pouvez ajouter que des cartes %@ à votre compte.";
/* 银行卡 - 绑卡失败 */
"response_msg_bankcard_bind_failure" = "Ajout de la carte bancaire échoué.";
/* 银行卡 - 重复绑卡 */
"response_msg_bankcard_bind_again" = "La carte bancaire a été ajoutée. Veuillez ne pas l'ajouter à nouveau.";
/* 银行卡 - 更新失败 */
"response_msg_bankcard_update_failure" = "Échec de la mise à jour des informations bancaires.";
/* 银行卡 - 删除失败 */
"response_msg_bankcard_remove_failure" = "Suppression de la carte bancaire échouée. Veuillez réessayer.";

// 原始
"payment_method_sadad" = "Sadad";
"payment_method_mada" = "Mada";
